# NewFamilyDocument Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewFamilyDocument Method
Application Class Example See Also
---
New family document, including family, titleblock, and annotation symbol
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual Document NewFamilyDocument(
	string templateFileName
)
```

Visual Basic
---
```text
Public Overridable Function NewFamilyDocument ( _
	templateFileName As String _
) As Document
```

Visual C++
---
```text
public:
virtual Document^ NewFamilyDocument(
	String^ templateFileName
)
```

# ### Parameters
templateFileName
    Type: System..::..StringThe template file name.
# Remarks
This command corresponds to File->New->Family.../TitleBlock.../Annotation Symbol....
# Examples
CopyC#
```text
// create a new family document using Generic Model.rft template
string templateFileName = @"C:\Documents and Settings\All Users\Application Data\Autodesk\RST 2010\Imperial Templates\Generic Model.rft";
Document familyDocument = application.NewFamilyDocument(templateFileName);
if (null == familyDocument)
{
    throw new Exception("Cannot open family document");
}
```

CopyVB.NET
```text
' create a new family document using Generic Model.rft template
Dim templateFileName As String = "C:\Documents and Settings\All Users\Application Data\Autodesk\RST 2010\Imperial Templates\Generic Model.rft"
Dim familyDocument As Document = application.NewFamilyDocument(templateFileName)
If familyDocument Is Nothing Then
    Throw New Exception("Cannot open family document")
End If
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | If 'templateFileName' is nullNothingnullptra null reference (Nothing in Visual Basic) or an empty string. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | If the new family document cannot be created. |

# See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace